import 'package:flutter/material.dart';

String details = "হজরত ওমর (রা.) এর গোলাম হজরত আসলাম (রা.) বলেন, আমি একবার হজরত ওমর (রা.) "
    "এর সঙ্গে মদীনার নিকটবর্তী হাররার দিকে যাচ্ছিলাম। হঠাৎ মরুভূমির এক জায়গায় আগুন জ্বলতে দেখা গেল। "
    "হজরত ওমর (রা.) এর নির্দেশে আমরা সেখানে গিয়ে একজন মহিলাকে দেখতে পেলাম, "
    "যার সঙ্গে কয়েকটি শিশু সন্তান ছিল। বাচ্চাগুলো কান্নাকাটি ও চিৎকার করছিল। "
    "পানিভর্তি একটি পাত্র চুলার ওপর বসানো ছিল আর নিচে আগুন জ্বলছিল। হজরত ওমর (রা.) সালাম করে অনুমতি নিয়ে মহিলার নিকট গেলেন এবং "
    "জিজ্ঞাসা করলেন, 'শিশুগুলো কাঁদছে কেন?' মহিলা জবাব দিলেন, ক্ষুধার জ্বালায় অস্থির হয়ে কাঁদছে। হজরত ওমর (রা.) "
    "বললেন, ‘এই পাত্রের মধ্যে কী আছে?’ মহিলা বললেন, "
    "‘তাদের ভুলিয়ে রাখার জন্য পানি ভর্তি করে চুলার ওপর রেখেছি যাতে তারা সান্তনা পায় ও ঘুমিয়ে পড়ে।’ "
    "তারপর মহিলা বললেন, ‘আমিরুল মুমেনীন হজরত ওমর (রা.) ও "
    "আমার মধ্যে আল্লাহর দরবারেই ফয়সালা হবে। কেননা তিনি আমার এই অভাব অনটনের কোনো খোঁজ খবর নেন না।’ "
    "একথা শুনে হজরত ওমর (রা.) কাঁদতে লাগলেন ও বললেন, ‘আল্লাহ তোমার ওপর রহম করুন। "
    "তোমার এই অবস্থা ওমর (রা.) কী করে জানবেন? মহিলা বললেন, "
    "‘তিনি আমাদের আমীর হয়েছেন অথচ আমাদের কোনো খোঁজ-খবর রাখেন না।’ "
    "হজরত আসলাম (রা.) বলেন, ‘ওমর (রা.) আমাকে নিয়ে ফিরে আসলেন এবং বাইতুল মাল হতে কিছু আটা, "
    "চর্বি, খেজুর, কিছু কাপড় ও দিরহাম নিয়ে একটি বস্তা বোঝাই করলেন এবং আমাকে বললেন, "
    "এটা আমার কোমরে উঠিয়ে দাও। আরজ করলাম, আমি নিয়ে যাব। তিনি রাজি হলেন না। "
    "আমি দু-তিন বার অনুরোধ করলে তিনি বললেন, কিয়ামতের দিনও কী আমার বোঝা তুমিই বহন করবে? "
    "এটা আমি বহন করে নিয়ে যাব। কেননা কেয়ামতের দিন এ ব্যাপারে প্রশ্ন করা হবে আমাকেই। "
    "পরিশেষে বাধ্য হয়ে আমি তার কোমরে বস্তা তুলে দিলাম। আমরা অতি দ্রুতগতিতে মহিলার নিকট পৌছালাম। "
    "অতঃপর পাতিলে কিছু আটা, চর্বি ও খেজুর ঢেলে তিনি নাড়াচাড়া শুরু করলেন এবং নিজেই চুলায় ফুঁ দিতে আরম্ভ করলেন। "
    "হজরত আসলাম (রা.) বলেন, আমি তার ঘন দাড়ির ভেতর দিয়ে ধোঁয়া বের হতে দেখলাম। "
    "কিছুক্ষণের মধ্যে হারিরার মত এক প্রকার খাদ্য তৈরি হয়ে গেল। "
    "তারপর তিনি নিজ হাতে বাচ্চাগুলোকে খাওয়ালেন, অবশিষ্ট খাদ্য মহিলার হাতে তুলে দিলেন। "
    "মহিলা অত্যন্ত আনন্দিত হয়ে বললেন, আল্লাহ তায়ালা তোমাকে উত্তম বদলা দান করুন। "
    "হযরত ওমর (রা.) এর পরিবর্তে তুমিই খলিফা হবার উপযুক্ত ছিলে। হজরত ওমর (রা.) "
    "তাকে সান্ত্বনা দিয়ে বললেন, যখন তুমি খলিফার নিকট যাবে তখন সেখানে আমাকেও দেখবে।\n\n"
    "শিক্ষণীয় বিষয়:\n"
    "(১) একজন শাসক বা পরিচালকের কর্তব্য নিষ্ঠা,\n\n"
    "(২) নিজেকে ছোট মনে করা। হজরত ওমর (রা.) খলিফা হয়েও নিজে বস্তা বহন করলেন এবং রান্না করলেন।\n\n"
    "(৩) মানুষের প্রতি দয়া, মায়া, ভালোবাসা ও সহমর্মিতা প্রদর্শন করা।\n\n"
    "(৪) নিজের কাজ নিজে করা। হজরত ওমর (রা.) বস্তা নিজেই বহন করলেন, গোলামকে দিলেন না।\n\n"
    "(৫) সৃষ্টিকর্তার নিকট জবাবদিহি করা।\n\n"
    "প্রকৃতপক্ষেই এক একজন সাহাবী মহানবী হজরত মুহাম্মাদ (সা.)-কে পুঙ্খানুপুঙ্খভাবে অনুসরণ করেছেন।"
    "জীবনের প্রতিটি ক্ষেত্রে তারা অন্যের কল্যাণে কথা চিন্তা করেছেন। এমনকি জীবনের অন্তিম মুহূর্তে অন্যকে পানি পান করিয়ে নিজে শহীদ হয়েছেন। ";

class HazratOmar extends StatelessWidget {

  //final String imgGP;
  final String imgGP="https://jooinn.com/images/hill-view.jpg";

   //const HazratOmar({
    //    Key? key,
   //     required this.imgGP
   //}) : super(key: key) ;

@override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("হজরত ওমর (রা.)"),
      ),
      body: Container(
        child: SingleChildScrollView(
          child: Column(
            children: [
              Image.network(imgGP),
              Container(
                margin: EdgeInsets.all(10.0),
                padding: EdgeInsets.all(5.0),
                child:  Text(details, style: TextStyle(fontSize: 18,color: Colors.black),)
              ),
            ],
          ),
        ),
      ),
    );
  }
}